
#Дан список с визитами по городам и странам. Напишите код,
# который возвращает отфильтрованный список geologs, содержащий только визиты из России."
geologs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

filtered_geologs = []
for visit in geologs:
    for country in visit.values():
        if 'Россия' in country:
            filtered_geologs.append(visit)

print(filtered_geologs)
